renesas-rx/rx-driver-package/source/r_lpc_rx/r_lpc_rx_vx.xx/r_lpc_rx/src/targets/rx210/r_lpc_rx210.c
}

/*********************************************************************************************************************
 End of function lpc_operating_mode_set
 ********************************************************************************************************************/

/*********************************************************************************************************************
 * Function Name: lpc_low_power_mode_configure
 * Description  : This function will configure the MCU for the specified Low Power Mode. In the Low Power Mode,
 *                the CPU is turned OFF and peripherals may be on or off depending on the mode. The supported
 *                low power modes are listed in the enum lpc_low_power_mode_t
 * Arguments    : e_mode - Low Power Mode
 *                    LPC_LP_SLEEP
 *                    LPC_LP_ALL_MODULE_STOP
 *                    LPC_LP_SW_STANDBY
 *                    LPC_LP_DEEP_SW_STANDBY
 *
 * Return Value : LPC_SUCCESS -
 ********************************************************************************************************************/
lpc_err_t lpc_low_power_mode_configure (lpc_low_power_mode_t e_mode)
{
    switch (e_mode)
    {
        case LPC_LP_SLEEP:
            R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);// unlock clock control registers
            SYSTEM.SBYCR.BIT.SSBY   = 0;        // Move to Sleep on wait()
            SYSTEM.MSTPCRA.BIT.ACSE = 0;
            R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR); // lock clock control registers
        break;
        
        case LPC_LP_ALL_MODULE_STOP:
            R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);// unlock clock control registers
            SYSTEM.SBYCR.BIT.SSBY      = 0;     // Move to All Module Stop on wait(). ACSE also needs to be set
            SYSTEM.MSTPCRA.BIT.ACSE    = 1;
            SYSTEM.MSTPCRA.BIT.MSTPA24 = 1;
            SYSTEM.MSTPCRA.BIT.MSTPA27 = 1;
            SYSTEM.MSTPCRA.BIT.MSTPA29 = 1;
            R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR); // lock clock control registers
    
       break;

        case LPC_LP_SW_STANDBY:
            R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);
            SYSTEM.SBYCR.BIT.SSBY    = 1;       // Move to Sw Stby on wait(); DPSBY also has to be modified
            SYSTEM.DPSBYCR.BIT.DPSBY = 0;
            SYSTEM.FHSSBYCR.BYTE = LPC_CFG_SW_STANDBY_OPTIONS; //Configure Sw Standby mode options
            R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);
        break;
        
        case LPC_LP_DEEP_SW_STANDBY:
            R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);// unlock clock control registers
            SYSTEM.SBYCR.BIT.SSBY    = 1;       // Move to Sw Stby on wait();DPSBY also has to be modified
            SYSTEM.DPSBYCR.BIT.DPSBY = 1;
            R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR); // lock clock control registers
        break;
    
        default:

            /* nothing here */
        break;
    }

    return LPC_SUCCESS;
}
/*********************************************************************************************************************
 End of function lpc_low_power_mode_configure
 ********************************************************************************************************************/

/*********************************************************************************************************************
 * Function Name: lpc_lowpower_activate
 * Description  : This function will activate the pre-configured low power mode. The wait() function re-enables
 *                interrupts.
 * Arguments    : void (*pcallback)(void* pdata)-
 *                Call back function to configure any un-configured interrupt that can be used to wake up from the low
 *                power mode. This can be a FIT_NO_FUNC if the interrupt(s) are already configured.
 *
 * Return Value : LPC_SUCCESS - Function will return only on waking up from low power mode.
 *                LPC_ERR_OSC_STOP_ENABLED -
 *                    The Software Standby Mode cannot be activated if oscillation stop detection is enabled.
 *                LPC_ERR_ILL_CLOCK_SOURCE -
 *                    The Sleep Mode Return Clock Switch is only supported if the clock source at the time of
 *                    entry to sleep mode is allowed clock.
 *                LPC_ERR_ILLEGAL
 *                    Other than those above.
 ********************************************************************************************************************/
lpc_err_t lpc_lowpower_activate (lpc_callback_set_t pcallback)
{
#if (LPC_CFG_PARAM_CHECKING_ENABLE == 1)
    lpc_err_t err;

    err = lpc_lowpower_activate_check();
    
    if (LPC_SUCCESS != err)
    {
        return err;
    }
#endif

    R_BSP_InterruptsDisable(); /* Clear the I bit to disable interrupts */
    if ((NULL != pcallback) && (FIT_NO_FUNC != pcallback)) /* If call-back is valid */
    {
        pcallback(FIT_NO_PTR); /* Call call-back to configure wake-up interrupt source */
    }
    else
    {
        nop();
        nop();
        nop();
        nop();
        nop(); /* Read last written IO register to make sure it is complete */
        nop(); /* or wait for 4-5 cycles till any prior write is complete */
    }

    wait();                         /* Enter Low Power mode */
    return LPC_SUCCESS;
}
/*********************************************************************************************************************
 End of function lpc_lowpower_activate
 ********************************************************************************************************************/

/*********************************************************************************************************************
 * Function Name: lpc_return_clock_switch
 * Description  : This function will configure the return clock switching parameter that allows the clock source to
 *                be switched on returning from Sleep Mode to either the HOCO or Main Clock. 
 * Arguments    : lpc_clock_switch_t e_clock_source -
 *                  Specify the clock source to switch to.
 *                bool enable
 *                  Enable/disable the Return clock Source switching function.
 * Return Value : LPC_SUCCESS
 *********************************************************************************************************************/
lpc_err_t lpc_return_clock_switch (lpc_clock_switch_t e_clock_source, bool enable)
{
    if (true == enable)
    {
        R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);
        SYSTEM.RSTCKCR.BYTE = (uint8_t) ((LPC_CLOCK_SWITCH_ENABLE << 7) | e_clock_source);
        R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);
    }
    else
    {
        R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);
        SYSTEM.RSTCKCR.BYTE = LPC_CLOCK_SWITCH_DISABLE;
        R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);
    }
    
    return LPC_SUCCESS;
}
/*********************************************************************************************************************
 End of function lpc_return_clock_switch
 ********************************************************************************************************************/

#if (LPC_CFG_PARAM_CHECKING_ENABLE == 1)
/*********************************************************************************************************************
 * Function Name: lpc_freq_range_check
 * Description  : This function will check clock frequency.
 * Arguments    : e_mode - Operating Mode
 *                    LPC_OP_HIGH_SPEED
 *                    LPC_OP_MIDDLE_SPEED_1A
 *                    LPC_OP_MIDDLE_SPEED_1B
 *                    LPC_OP_LOW_SPEED_1
 *                    LPC_OP_LOW_SPEED_2
 * Return Value : LPC_SUCCESS -
 *                LPC_ERR_CLOCK_EXCEEDED -
 *                    If the current system clocks dividers are higher than those supported by the e_mode operating mode.
 ********************************************************************************************************************/
static lpc_err_t lpc_freq_range_check (lpc_operating_mode_t e_mode)
{
    uint32_t iclk_freq;
    uint32_t bclk_freq;
    uint32_t fclk_freq;
    uint32_t pclkb_freq;
    uint32_t pclkd_freq;

    /* Clock source frequencies. The HOCO and PLL values need to be calculated by
     * R_CGC_ClockHzGet() before they are valid. These map to enum cgc_clocks_t */
    clock_frequency[0] = BSP_LOCO_HZ;      // LOCO
    clock_frequency[1] = BSP_HOCO_HZ;      // HOCO
    clock_frequency[2] = BSP_CFG_XTAL_HZ;  // MAIN
    clock_frequency[3] = BSP_SUB_CLOCK_HZ; // SUBCLK
    clock_frequency[4] = 0;                // PLL
    clock_frequency[5] = 125000;           // IWDT - 125 kHz

    hoco_frequency[0] = 32000000; // 32 MHz
    hoco_frequency[1] = 36864000; // 36.864 MHz
    hoco_frequency[2] = 40000000; // 40 MHz
    hoco_frequency[3] = 50000000; // 50 MHz

    iclk_freq = lpc_clockhzget(LPC_ICLK);
    bclk_freq = lpc_clockhzget(LPC_BCLK);
    fclk_freq = lpc_clockhzget(LPC_FCLK);
    pclkd_freq = lpc_clockhzget(LPC_PCLKD);
    pclkb_freq = lpc_clockhzget(LPC_PCLKB);

