renesas-rx/rx-driver-package/source/r_lpc_rx/r_lpc_rx_vx.xx/r_lpc_rx/src/targets/rx210/r_lpc_rx210.c
    switch (e_mode)
    {
        /* Check if clock speeds are within limits */
        case LPC_OP_HIGH_SPEED:
            if (((((iclk_freq > LPC_MAX_ICK_HIGH_SPEED_FREQ_HZ)
                || (bclk_freq > LPC_MAX_BCK_HIGH_SPEED_FREQ_HZ))
                || (fclk_freq > LPC_MAX_FCK_HIGH_SPEED_FREQ_HZ))
                || (pclkd_freq > LPC_MAX_PCKD_HIGH_SPEED_FREQ_HZ))
                || (pclkb_freq > LPC_MAX_PCKB_HIGH_SPEED_FREQ_HZ))
            {
                return LPC_ERR_CLOCK_EXCEEDED;
            }
        break;
        case LPC_OP_MIDDLE_SPEED_1A:
            if (((((iclk_freq > LPC_MAX_ICK_MID1A_SPEED_FREQ_HZ)
                || (bclk_freq > LPC_MAX_BCK_MID1A_SPEED_FREQ_HZ))
                || (fclk_freq > LPC_MAX_FCK_MID1A_SPEED_FREQ_HZ))
                || (pclkd_freq > LPC_MAX_PCKD_MID1A_SPEED_FREQ_HZ))
                || (pclkb_freq > LPC_MAX_PCKB_MID1A_SPEED_FREQ_HZ))
            {
                return LPC_ERR_CLOCK_EXCEEDED;
            }
        break;
        case LPC_OP_MIDDLE_SPEED_1B:
            if (((((iclk_freq > LPC_MAX_ICK_MID1B_SPEED_FREQ_HZ)
                || (bclk_freq > LPC_MAX_BCK_MID1B_SPEED_FREQ_HZ))
                || (fclk_freq > LPC_MAX_FCK_MID1B_SPEED_FREQ_HZ))
                || (pclkd_freq > LPC_MAX_PCKD_MID1B_SPEED_FREQ_HZ))
                || (pclkb_freq > LPC_MAX_PCKB_MID1B_SPEED_FREQ_HZ))
            {
                return LPC_ERR_CLOCK_EXCEEDED;
            }
        break;
        case LPC_OP_LOW_SPEED_1:
            if (((((iclk_freq > LPC_MAX_ICK_LOW1_SPEED_FREQ_HZ)
                || (bclk_freq > LPC_MAX_BCK_LOW1_SPEED_FREQ_HZ))
                || (fclk_freq > LPC_MAX_FCK_LOW1_SPEED_FREQ_HZ))
                || (pclkd_freq > LPC_MAX_PCKD_LOW1_SPEED_FREQ_HZ))
                || (pclkb_freq > LPC_MAX_PCKB_LOW1_SPEED_FREQ_HZ))
            {
                return LPC_ERR_CLOCK_EXCEEDED;
            }
            if (LPC_CLOCK_ACTIVE == SYSTEM.PLLCR2.BYTE) /* Check if PLL is running */
            {
                return LPC_ERR_CLOCK_EXCEEDED;
            }
        break;
        case LPC_OP_LOW_SPEED_2:
            if (((((iclk_freq > LPC_MAX_ICK_LOW2_SPEED_FREQ_HZ)
                || (bclk_freq > LPC_MAX_BCK_LOW2_SPEED_FREQ_HZ))
                || (fclk_freq > LPC_MAX_FCK_LOW2_SPEED_FREQ_HZ))
                || (pclkd_freq > LPC_MAX_PCKD_LOW2_SPEED_FREQ_HZ))
                || (pclkb_freq > LPC_MAX_PCKB_LOW2_SPEED_FREQ_HZ))
            {
                return LPC_ERR_CLOCK_EXCEEDED;
            }

            if (((LPC_CLOCK_ACTIVE == SYSTEM.HOCOCR.BYTE)   /* Check if HOCO is running */
               || (1 == SYSTEM.OSTDCR.BIT.OSTDE))           /* Check if Oscillation Main Stop Detection Function is enabled */
               || (LPC_CLOCK_ACTIVE == SYSTEM.PLLCR2.BYTE)) /* Check if PLL is running */
            {
                return LPC_ERR_CLOCK_EXCEEDED;
            }
        break;
        default:

            /* nothing here */
        break;
    }

    return LPC_SUCCESS;
}
/*********************************************************************************************************************
 End of function lpc_freq_range_check
 ********************************************************************************************************************/

/*********************************************************************************************************************
 * Function Name: lpc_clockhzget
 * Description  : This function will return the requested internal clock frequency in Hz
 * Arguments    : lpc_system_clocks_t clock -
 *                    Specifies the internal clock whose frequency will be returned in Hz .
 *
 * Return Value : uint32_t frequency - clock  frequency in hz
 ********************************************************************************************************************/
static uint32_t lpc_clockhzget (lpc_system_clocks_t clock)
{
    uint32_t divisor;
    uint32_t pll_clk_src_freq;
    float pll_multiplier;

    /* Determine the current HOCO frequency */
    clock_frequency[LPC_CKSEL_HOCO] = 0;
    if (LPC_CLOCK_ACTIVE == SYSTEM.HOCOCR.BIT.HCSTP)
    {
        /* Get the currently programmed HOCO frequency and update the clock_frequency[]
         * array in case it has changed. */
        clock_frequency[LPC_CKSEL_HOCO] = hoco_frequency[SYSTEM.HOCOCR2.BIT.HCFRQ];
    }

    /* Determine the current PLL frequency */
    clock_frequency[LPC_CKSEL_PLL] = 0;
    if (LPC_CLOCK_ACTIVE == SYSTEM.PLLCR2.BIT.PLLEN)
    {
        /*
         * Calculate the PLL clock frequency as follows:
         * - Determine the main oscillator's frequency
         * - Determine the programmed PLL input divider value from PLLCR.PLIDIV
         * - Determine the programmed PLL output multiplier from PLLCR.STC
         * - Calculate the PLL clock frequency as ((SRC_CLK_FREQ / PLL_DIV) * PLL_MUL)
         */
        pll_clk_src_freq = clock_frequency[LPC_CKSEL_MAIN_OSC];
        pll_multiplier = (float) SYSTEM.PLLCR.BIT.STC + 1.0f;

        /* Finally, calculate the PLL clock frequency */
        clock_frequency[LPC_CKSEL_PLL] = (uint32_t) (((float) pll_clk_src_freq / (float) (1 << SYSTEM.PLLCR.BIT.PLIDIV))
                * pll_multiplier);
    }

    /* Retrieve the programmed divisor for the clock being queried */
    switch (clock)
    {
        case LPC_ICLK :
            divisor = (uint32_t) (1 << SYSTEM.SCKCR.BIT.ICK);
        break;
        case LPC_BCLK :
            divisor = (uint32_t) (1 << SYSTEM.SCKCR.BIT.BCK);
        break;
        case LPC_FCLK :
            divisor = (uint32_t) (1 << SYSTEM.SCKCR.BIT.FCK);
        break;
        case LPC_PCLKB :
            divisor = (uint32_t) (1 << SYSTEM.SCKCR.BIT.PCKB);
        break;
        case LPC_PCLKD :
            divisor = (uint32_t) (1 << SYSTEM.SCKCR.BIT.PCKD);
        break;
        default :
            divisor = (uint32_t) (1 << SYSTEM.SCKCR.BIT.ICK);    /* Forced select ICLK when invalid arg */
        break;
    }

    return (uint32_t) ((float) clock_frequency[SYSTEM.SCKCR3.BIT.CKSEL] / (float) divisor);
}
/*********************************************************************************************************************
 End of function lpc_clockhzget
 ********************************************************************************************************************/

/*********************************************************************************************************************
 * Function Name: lpc_lowpower_activate_check
 * Description  : This function will check if low power activate can be executed.
 * Arguments    : void 
 *
 * Return Value : LPC_SUCCESS - 
 *                LPC_ERR_OSC_STOP_ENABLED -
 *                    The Software Standby Mode cannot be activated if oscillation stop detection is enabled.
 *                LPC_ERR_ILL_CLOCK_SOURCE -
 *                    The Sleep Mode Return Clock Switch is only supported if the clock source at the time of
 *                    entry to sleep mode is the SubClock or LOCO.
 *                    If the return mode is Medium Speed Mode, then HOCO cannot be used as the return clock.
 *                LPC_ERR_ILLEGAL
 *                    Other than those above.
 ********************************************************************************************************************/
static lpc_err_t lpc_lowpower_activate_check (void)
{
    uint8_t rstckcr_rstcksel;

    if (0x1 == SYSTEM.SBYCR.BIT.SSBY) /* check if entering software standby or deep software standby */
    {
        if (LPC_OSC_STOP_ENABLED == SYSTEM.OSTDCR.BIT.OSTDE)
        {
            return LPC_ERR_OSC_STOP_ENABLED;/* Cannot enter SW_Standby if Oscillation Stop is enabled */
        }
        
        if ((0 == SYSTEM.MSTPCRA.BIT.MSTPA28) 
            && ((1 == DTC.DTCST.BIT.DTCST) || (1 == DMAC.DMAST.BIT.DMST)))
        {
            return LPC_ERR_ILLEGAL;         /* Cannot enter SW_Stanbay if DTC or DMAC is enabled */
        }
        
        /* Check FENTRY0(b0) and FENTRYD(b7) */
        if (0x0000 != (FLASH.FENTRYR.WORD & 0x0081))
        {
            return LPC_ERR_ILLEGAL;         /* Cannot enter SW_Stanbay if P/E mode entry */
        }

        if ((LPC_SUB_CLOCK == SYSTEM.SCKCR3.WORD)
           && ((1 != RTC.RCR3.BIT.RTCEN) && (LPC_CLOCK_ACTIVE != SYSTEM.LOCOCR.BYTE)))
        {
            return LPC_ERR_ILL_CLOCK_SOURCE; /* Cannot enter SW_Stanbay if RTC disable or LOCO stoped when subclock selected */
        }
        
        if (0x01 == SYSTEM.DPSBYCR.BIT.DPSBY)   /* check if entering deep software standby */
        {
            if (0x00000000 == (LPC_OFS0_REG_VALUE & 0x00000002))    /* IWDT auto start check */
            {
                if (0x00000000 == (LPC_OFS0_REG_VALUE & 0x00004000))
                {
                    return LPC_ERR_ILLEGAL;     /* Cannot enter DSW_Standby if IWDT auto start and IWDT count stop disable */
                }
            }
            else
            {
                if (0 == IWDT.IWDTCSTPR.BIT.SLCSTP)
                {
                    return LPC_ERR_ILLEGAL;     /* Cannot enter DSW_Standby if IWDT count stop disable */
                }
            }
            
